export const content = [
    {
        h1: '什么是Easiest',
        p: 'Easiest 是一个开发平台。它能帮你更轻松的构建 Web。Easiest 集声明式模板、依赖注入和一些实践于一身，为您解决开发方面的各种挑战。',
    },
    {
        h1: '基本假设',
        p: '本文档假设你已经熟悉了 JavaScript 和来自 最新标准 的一些知识，比如 类 和 模块。 下列代码范例都是用最新版本的 TypeScript 写的，利用 类型 实现依赖注入，并使用装饰器来提供元数据。',
    },
    {
        h1: '美妙的工具',
        p: '使用简单的声明式字符串模板，快速实现各种特性。使用自定义组件和扩展模板语言。基于Javascript和Typescript，可以在几乎所有的IDE中获得即时帮助和反馈。所有这一切，都是为了帮助你编写漂亮的应用，而不是绞尽脑汁的让代码“能用”。',
    },
    {
        h1: '基本理念',
        p: 'Easiest 基于mvvm, 本身使用 TypeScript写成的。它将核心功能和可选功能作为一组 TypeScript 库进行实现，你可以把它们导入你的应用中。Easiest 基本构造块是 EsModule，它为组件提供了编译的上下文环境',
    },
    {
        h1: '反馈',
        p: '你也可以和我们一起做贡献！你可以到 什么是Easiest 在 Github 上的仓库中提出文档方面的问题，并创建Pull Requests。',
    },
];
